["@MartinWinckler Il est question du paramédical ici. A Rennes depuis 99 plus de bizutage. Nous avons été la première promo a préparer un WE d'intégration pour nos P2, et c'était nous qui nous ridiculisions sciement au travers de squetch, etc. Ça mérite un #okboomer", "Twitter is making me feel old, I have no idea who Camila Cabello and Shawn Mendes are or that they were \"together\" #okboomer", "After this, we went to Publix and encountered three more boomers acting with complete disregard for other people.  #okboomer #boomers #inconsiderate #entitlement #entitled #oldpeople  https://t.co/3X8yJq1dpk", "Je regarde mes tweets d'aujourd'hui dans mes références j'ai Jean-Paul Belleau, Pat Burns, Francis Cabrel, Joey de Friends et Gainsbourg , je pense que je vais m'auto-distribuer un #okboomer", "@Fedez Non ho capito nulla. Aiuto! #okboomer", "There’s one thing I really love about being middle-aged compared to being a teenager. Teenagers always seem to be  embarrassed, yet we just don’t give a shit anymore... It is a great feeling! #OKBoomer", "@duty2warn All professionals should be forced to retire at 70. No exceptions. Think of how much inexcusable nonsense could have been avoided in recent years. #okboomer #ByeFelicia #TermLimits", "I've been saying this for YEARS now. It is an immature \"boomer\" narrative that kids are shitty unlike them older generations derp derp. I cannot stand it. It is ignorant and offensive which they couldn't care less about. Smh #okboomer #Respect  https://t.co/YSIMJfJpZB", "@souboaaolonge #okboomer", "@RonFilipkowski Maybe it's time he retire and 'spend more time with the family'.  He's an old coot and he needs to go. #okboomer", "@OfficialTravlad #OkBoomer, great time for an entry.   https://t.co/d0QrYnyNrh", "what's a \"millibyte?\" Asking for a friend.... 🥴#millibyte #okboomer", "@Gandalfcompl Całkiem Gituwa słowo 😅 #okboomer", "#okboomer generation doesn't understand the impact that #automatization, #web3, #cryptocurrency combined with low immigration and the #globalpandemic is having and will have on job markets. #antiwork movement members are not lazy. They are young and smart.", "@GhostBoomerDog @Rome8Romero @JusticeDemWatch @davetroy I have zero respect for the FEC. Also they wouldn't have put loose cannons in, they'd have put easily manipulated people. Also also got evidence it happened cuz if not again I reiterate: #okboomer", "@GhostBoomerDog @Rome8Romero @JusticeDemWatch @davetroy Individual contributions aka from individuals lololol she outraised her opponent from millions in donations from her voters and that's a bad thing because they didn't itemize it? #OkBoomer.", "Check out this f*cking boomer. “19 year-olds can die fighting the War on Terror while my fat ass sits at home, but can’t have an opinion on the PATRIOT Act.” #okboomer", "Oh @FoxNews  you're trash... #quityourbullshit #OKBoomer  https://t.co/9poL2HVwGk", "@cryptocom Take that Peter Schiff! #boomer #okboomer #Crypto @cryptocom @mikemajlak @LoganPaul  https://t.co/yO34SyWegA", "\"As the old get richer, young people pay the price?\"   https://t.co/SR4PkOtEhE @Munku1 @InvariantPersp1 @lize1968 @MESandbu @danielleiwood @BrendanCoates  #OKBoomer #ageing #demographics"]