["@BevoBurgers @kdiz825 @FoxNews Are you trying to say you don’t know what the verdict represents? #okboomer", "Nothing like the table of boomers next to you at dinner bemoaning the closing of the last Kmart in Michigan. #okboomer", "@harikondabolu #OkBoomer", "No animals were harmed in the making of this video… but one was severely annoyed. 😒  https://t.co/S0y8jU1rtt  #Millennial #OKBoomer #TooOldForTikTok #BadInfluencer  https://t.co/6SScTfOLh4", "Na zakończenie #OkBoomer 😎 Video ostro skompresowane, jak przystało na boomerów ;)  https://t.co/Kb63e3FeUq", "To była bardzo dobra impreza. Nie sądziłem, że ten cały #FiszEmadeTworzywo tak dobrze wypada na żywo. Zaczęli od „Nie za miłych wiadomości”, a skończyli wiadomo #OkBoomer na bis. Wsród gawiedzi rzeczywiście średnia mocno ponad 30+, albo tylko takie wrażenie ;)  https://t.co/Wmi2Yw7meI", "@cspan Ok, I’m done. I expected something more. Guess old white dudes really just do not care. #okboomer", "j'ai parlé de whatsapp avec mes 4ème \"c'est le réseau des darons monsieur\" je me suis pris un #okboomer", "J'ai connu des nanas qui avaient le même \"discours\" sous acide dans les années 70 😬😬😬  #OkBoomer #Quotidien", "@buzzardslicer @YozeMight @dukecastle1 @zuldiras @willtrb @TheOnion Didn't cross with the ar but #okboomer", "Was für ein Kracher. Ich feiere das ja. #okboomer #shrindavid #kittykat  https://t.co/rBec2uUI8E", "#OKboomer  https://t.co/87OIU8vTVM", "@Casti_F ci sta un amico mio si chiama Marra, tutt la giornata a pensare ma chi è sto rapper che si chiama come lui #okboomer", "Selon François Legault, la violence à Montréal s'expliquerait par les jeux vidéos...  #okboomer", "@pasam_ramanji @narravulabhuva1 @payalmehta100 @tweet4telugu @ncbn Idiot, that means everyone understood why it happened and moved on. If you want stuck there, #okboomer", "Bless you @StreetsblogUSA @BrentToderian + @DavidZipper for saying far more eloquently what I was feeling when I saw the @POTUS driving an electric Hummer - and did anyone else also think #OKBoomer?  https://t.co/OrWCfAkRip #bikes4climate #buslove #TransitLove #walklove", "@PaulHinmanWIPA good stuff *now cue the #okboomer crew and their 'we want to go extinct and do nothing' nonsense  no wonder Conservatives lose all the time all... the... time...", "@AppletoZucchini @scottyd121 Having grown up hearing nonstop about the amazing rebellious and culture-altering baby boomers of the 60’s there is no generation I’m more disappointed in #okboomer  https://t.co/Ba3kxWsPIs", "@Marie_thibaut @gerydemaet @STIBMIVB le mec il est encore en 1990...faut peut être lui dire qu'on ne peut plus se garer sur la grand-place aussi!! #vroomer #okboomer", "\"Please help us old folk, we're sorry about destroying your confidence in fiat currencies.\" #bitcoin #okboomer  https://t.co/HxRnGTWB32"]