["More Conservatives Turn Away From #DeathPenalty. #Utah prosecutor @davidoleavitt, hailing from a conservative county, is taking death penalty off the table in 2017 murder of two teens.  https://t.co/HjgilaZ1Tv @WSJ @LauraKusisto @UtahCoAttorneys @CCATDP @lowrysnow @DPInfoCtr", "The Geriatric Ward: #NorthCarolina’s aging death row population faces looming health care crisis.  https://t.co/76uvNulZRT @theintercept @jacobbiba #LyleCMay @NCPolicyWatch @DavidCFathi @DPInfoCtr #deathpenalty", "We'll be seeing stuff at #Nuremberg2 - keep track and make notes of their hateful inaccurate vaxx-pushing propaganda #DeathPenalty", "Top 10 Reasons The Death Penalty Should Be Abolished  https://t.co/nul9El2eHs #deathpenalty", "Guns.  Lower taxes on the wealthy. Privatization of healthcare. “Secure” borders. The #deathpenalty  ….Why do these so often come as a package deal with #Jesus in #america ?", "What kind of world we live in when you feel the death penalty is okay? You're no different then the person you're persecuting. In God's eyes, murder is murder. You will all have to answer God in the end, especially you so-called Christians. #deathpenalty", "@uchennayaogba #Thug #IllIntent #Animal #DeathPenalty just for starters.", "After a frenetic week of #deathpenalty developments, a reminder about our on Discussions With DPIC podcast conversation with @BECKETlaw’s #DanielChen on Ramirez v. Collier and the exercise of religion in the execution chamber.  https://t.co/2KUGeySrY5 @DPInfoCtr", "Don't miss this moving conversation with Pervis Payne's sister and attorney about the Shelby County DA's decision to finally acknowledge his intellectual disability and remove his death sentence. #JoyandRelief #PervisPayne #deathpenalty", "A tiny step toward modernity,  rationality and a little bit of compassion mixed in (paywall). More Conservatives Turn Away From Death Penalty #DeathPenalty #PenalCode #USJudiciary   https://t.co/fMU3KK7S4r", "The doctors are part of the propaganda and deception.  It is clear that they are too afraid to speak out or are being paid off by compensation. They are guilty of crimes against Humanity. #CrimesAgainstHumanity #deathpenalty #Nuremberg2  https://t.co/yxg7vDeMIp", "Absolutely!  We will ensure that Doug Ford @fordnation and his accomplices pay for their crimes against Humanity for a start.  Then Justin Trudeau, @JustinTrudeau and his accomplices. #murder #CrimesAgainstHumanity #deathpenalty #NurembergTrialsForCovid #treason  https://t.co/f8XBnuQU2O", "@SecBlinken That’s right no body should be killed because of his sexual orientation sex or ethnicity but @SecBlinken dont make big talks your partners the gulf states sharia’s laws allow the #deathpenalty for #gays but Your administration never condemns them for #homophobia.", "Sickening Evidence In Ghislaine Maxwell Trial Shows She ‘Set Up VIP Elites’ With Kids To Rape – enVolve  If you still don’t understand, you better hurry up. The whole corrupt truth is coming. #savethechildren #deathpenalty #therealvirus   https://t.co/1zCCJGkhPG", "@saint #PeteDavidson &amp; #KimKardashian prefect couple. She is studying to become a #lawyer. #OKGOV gave #JuliusJones #cemency over the #deathpenalty in light of #racistjurors calling him the #Nword &amp; that the should \"take him out back &amp; lynch him\" 20 yrsago final heard.", "Everyone’s like “#deathpenalty for pedophiles!” or “#castrate #pedophiles!” Until one attacks someone and gets killed by #selfdefense, now all of a sudden it’s a #tragedy.", "Take action: Abolish the #deathpenalty once and for all! Urge your elected officials to permanently end this immoral and discriminatory policy!  https://t.co/v2PzlbkcBq", "#ItsNotOk #YouMatter #TalkAboutIt  The former president talked about the “rule of law” but it was #FakeNews. The law is not “just” in every case. Often the guilty go free and the innocent go to jail. It is time for the #DeathPenalty to be abolished. @POTUS @helenprejean", "#Wisconsin Gov. Grieves Loss Of Life 🙄, Pleads For #Peace &amp; #Justice After #KyleRittenhouse Verdict. Translation: Eat another shit sandwich anybody who thinks that sniveling, #RightWing #Maniac (redundant?) deserves to get the #DeathPenalty.  https://t.co/X3XRvzSQor", "Death Penalty News: Iran | Man Executed in Shiraz  https://t.co/rPcQBoD5Mq #Iran #sharia #islam #deathpenalty  https://t.co/pr4QYR4w5u"]